{
  "name": "Toan Tran",
  "info": {},
  "meta": {
    "format": "FRESH@0.6.0",
    "version": "0.1.0"
  },
  "location": {
    "city": "Ho Chi Minh",
    "country": "VietNam",
    "address": "37 Tran Huu Trang"
  },
  "employment": {
    "history": [
      {
        "position": "Backend Developer",
        "employer": "SourceSage",
        "summary": "SourceSage is a physical trading mobile platform, which aims to provide real-time, accurate market information; helps B2B companies source and sell on-demand.",
        "current": true,
        "start": "2015-12",
        "url": "https://sourcesage.co",
        "keywords": [],
        "highlights": [
          "Developed and implemented a REST API using Flask",
          "Scraping trading articles using import.io and scrapy",
          "Created user and API documentation, unit tests with high code coverage.",
          "Technologies: Flask, Scrapy, SQLAlchemy, MySql, Elasticsearch, Unittest, Drone"
        ]
      },
      {
        "position": "Backend Developer (Freelance)",
        "employer": "FitFix",
        "summary": "Fitfix is a startup based in Singapore which focuses on mobile application aims to reinvent fitness and wellbeing by making it social, easily accessible, fun and affordable.",
        "start": "2015-9",
        "end": "2016-1",
        "url": "http://www.fitfix.in/",
        "keywords": [],
        "highlights": [
          "Created Web services for fitness activities between trainer and trainee (create and schedule event, chatting, payment via Stripe ...)",
          "Created user and API documentation.",
          "Worked in multilingual teams, participated in regular meetings and planning.",
          "Technologies: Flask, SQLAlchemy, MySql, StripeAPI"
        ]
      },
      {
        "position": "Backend Developer",
        "employer": "Golfconnect24",
        "summary": "Golfconnect24 is an app/web solution for real-time online booking, Escorecard, and other features aimed to eliminate unnecessary hassles so busy individuals/professionals can better enjoy the game with ease and at the same time, to help golfcoures to actively reach out to their customers & serve what the golfers are expecting. Part of a medium-sized development team at sports-based exciting startup. I’m responsible for turning the original prototype into a fully functional website, taking care of everything from front-end design to server-side coding (Python/Django) and server administration.",
        "start": "2014-06",
        "end": "2016-10",
        "url": "https://golfconnect24.com",
        "keywords": [],
        "highlights": [
          "Maintain, design and develop REST APIs for comprehensive Python/Django codebase that supports golf properties with content management, data management features.",
          "Making heavy use of asynchronous processing with Celery and Redis for golf score calculation, sending emails, pushing notification via Parse, SNS",
          "Write NodeJs script as proxy between Django and Redis for realtime architecture.",
          "Structure the front-end app with ng-boilerplate (Sass, Grunt, Bower...).",
          "Develop front-end feature using Foundation and Angular. (Online booking, Listing Events, full responsive functionality available across devices and desktop browsers).",
          "Assisted in creating a culture of good development practices including testing guidelines, code reviews, git workflow and proper code style.",
          "Dockerize backend, frontend and Nodejs server for deployment.",
          "Built Jenkins server for auto test, build and deploy docker images.",
          "Technologies: Django, Django Rest Framework, PostgreSQL, AngularJS, Nginx, Redis, Docker"
        ]
      }
    ]
  },
  "education": {
    "level": "",
    "history": [
      {
        "institution": "University of Science",
        "start": "2011",
        "end": "2015",
        "grade": "GPA: 8.0",
        "summary": "",
        "area": "Computer Science",
        "studyType": "Bachelor"
      }
    ]
  },
  "skills": {
    "sets": [
      {
        "name": "Web Development",
        "level": "Master",
        "skills": [
          "HTML",
          "CSS",
          "Javascript",
          "AngularJs",
          "Flask",
          "Django",
          "MySql",
          "PostgreSQL",
          "Scraper"
        ]
      }
    ]
  },
  "writing": [],
  "social": [
    {
      "label": "Github",
      "network": "Github",
      "url": "https://github.com/tdvtoan",
      "user": "tdvtoan"
    }
  ],
  "interests": [
    {
      "name": "Traveling"
    },
    {
      "name": "Reading"
    }
  ],
  "testimonials": 0,
  "languages": [
    {
      "name": "English",
      "level": "Fluent"
    }
  ]
}